# Зчитуємо дійсні числа x і y з клавіатури
x = float(input("Введіть число x: "))
y = float(input("Введіть число y: "))

# Перевіряємо, яке з чисел менше
if x < y:
    # Замінюємо менше число половиною їх суми
    x = (x + y) / 2
    # Замінюємо більше число їх подвоєним добутком
    y = 2 * x
else:
    # Замінюємо менше число половиною їх суми
    y = (x + y) / 2
    # Замінюємо більше число їх подвоєним добутком
    x = 2 * y

# Виводимо результат
print("Менше число замінене на", x)
print("Більше число замінене на", y)
