# Зчитуємо координати точки з клавіатури
x = float(input("Введіть координату x точки А: "))
y = float(input("Введіть координату y точки А: "))

# Визначаємо місцезнаходження точки
if x == 0 and y == 0:
    print("Точка А знаходиться в початку координат.")
elif x == 0:
    print("Точка А знаходиться на вісі Y.")
elif y == 0:
    print("Точка А знаходиться на вісі X.")
elif x > 0 and y > 0:
    print("Точка А знаходиться в першому квадранті.")
elif x < 0 and y > 0:
    print("Точка А знаходиться в другому квадранті.")
elif x < 0 and y < 0:
    print("Точка А знаходиться в третьому квадранті.")
else:
    print("Точка А знаходиться в четвертому квадранті.")
