# Присвоєння значення змінній
var_num = 5

# Перевірка значення змінної
if var_num > 0:
    # Виведення повідомлення
    print("Значення змінної більше 0!")
else:
    # Виведення іншого повідомлення
    print("Значення змінної менше або дорівнює 0.")

# Зміна значення змінної
var_num = -2

# Повторна перевірка значення змінної
if var_num > 0:
    # Виведення повідомлення
    print("Значення змінної більше 0!")
else:
    # Виведення іншого повідомлення
    print("Значення змінної менше або дорівнює 0.")

# Вдосконалення коду
if var_num > 0:
    print(1)
else:
    print(-1)
